In [15]:
import pandas as pd
import numpy as np

In [19]:
nums = pd.Series(range(500))

In [20]:
nums

0        0
1        1
2        2
3        3
4        4
      ...
495    495
496    496
497    497
498    498
499    499
Length: 500, dtype: int64

In [23]:
nums.head(10)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [24]:
nums.tail(10)

490    490
491    491
492    492
493    493
494    494
495    495
496    496
497    497
498    498
499    499
dtype: int64

In [39]:
nums = pd.Series([1,2,np.nan,4,5])
nums

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [31]:
hello = pd.Series(list('hello'))

In [32]:
hello

0    h
1    e
2    l
3    l
4    o
dtype: object

In [33]:
hello.nunique()

4

In [43]:
nums.count()

4

In [45]:
nums.sum()
#nums.sum(skipna=True) skipna를 false로 값을주면 nan값이 뜸

12.0

In [46]:
nums.mean()

3.0

In [47]:
nums.median()

3.0

In [49]:
nums.std()

1.8257418583505538

In [50]:
nums.max()

5.0

In [51]:
nums.min()

1.0

In [54]:
somechar = pd.Series(list("AaBbCc"))
print(somechar.max())
print(somechar.min())
print(ord('a'))
print(ord('A'))

c
A
97
65

In [18]:
nums.describe()

count    4.000000
mean     2.500000
std      1.290994
min      1.000000
25%      1.750000
50%      2.500000
75%      3.250000
max      4.000000
dtype: float64

In [55]:
hello.describe()

count     5
unique    4
top       l
freq      2
dtype: object

In [56]:
nums

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [57]:
list(nums)

[1.0, 2.0, nan, 4.0, 5.0]

In [58]:
dict(nums)

{0: 1.0, 1: 2.0, 2: nan, 3: 4.0, 4: 5.0}

In [61]:
superheros = [
 "Batman",
 "Superman",
 "Spider-Man",
 "Iron Man",
 "Captain America",
 "Wonder Woman"
]
strength_levels = (100, 120, 90, 95, 110, 120)

In [67]:
#연습문제 1
#a = pd.DataFrame(strength_levels,superheros)
#a[0]
a = pd.Series(strength_levels,superheros)
a

Batman             100
Superman           120
Spider-Man          90
Iron Man            95
Captain America    110
Wonder Woman       120
dtype: int64

In [68]:
#연습문제 2
a.tail(4)

Spider-Man          90
Iron Man            95
Captain America    110
Wonder Woman       120
dtype: int64

In [69]:
#연습문제 3
a.nunique()

5

In [70]:
#연습문제 4
print(a.mean())
print(a.median())
print(a.max())
print(a.min())

90
120
105.83333333333333
105.0

In [71]:
#연습문제 5
dict(a)

{'Batman': 100,
 'Superman': 120,
 'Spider-Man': 90,
 'Iron Man': 95,
 'Captain America': 110,
 'Wonder Woman': 120}

In [114]:
pokemons = pd.read_csv("../datas/pokemon.csv", index_col="Pokemon").squeeze()
pokemons

Pokemon
Bulbasaur      Grass / Poison
Ivysaur        Grass / Poison
Venusaur       Grass / Poison
Charmander               Fire
Charmeleon               Fire
                    ...
Stakataka        Rock / Steel
Blacephalon      Fire / Ghost
Zeraora              Electric
Meltan                  Steel
Melmetal                Steel
Name: Type, Length: 809, dtype: object

In [103]:
pokemons.describe()

count        809
unique       159
top       Normal
freq          65
Name: Type, dtype: object

In [104]:
pokemons.sort_values() #값에 의한 오름차순 정렬

Pokemon
Illumise                Bug
Silcoon                 Bug
Pinsir                  Bug
Burmy                   Bug
Wurmple                 Bug
                  ...
Tirtouga       Water / Rock
Relicanth      Water / Rock
Corsola        Water / Rock
Carracosta     Water / Rock
Empoleon      Water / Steel
Name: Type, Length: 809, dtype: object

In [95]:
pokemons.sort_values(ascending = False) #값에 의한 내림차순 정렬

Pokemon
Empoleon      Water / Steel
Corsola        Water / Rock
Relicanth      Water / Rock
Carracosta     Water / Rock
Tirtouga       Water / Rock
                  ...
Kricketune              Bug
Cascoon                 Bug
Scatterbug              Bug
Kricketot               Bug
Grubbin                 Bug
Name: Type, Length: 809, dtype: object

In [121]:
google = pd.read_csv("../datas/google_stocks.csv",
                        parse_dates=["Date"],
                        index_col="Date",
                        ).squeeze()
google

Date
2004-08-19      49.98
2004-08-20      53.95
2004-08-23      54.50
2004-08-24      52.24
2004-08-25      52.80
               ...
2019-10-21    1246.15
2019-10-22    1242.80
2019-10-23    1259.13
2019-10-24    1260.99
2019-10-25    1265.13
Name: Close, Length: 3824, dtype: float64

In [129]:
war = pd.read_csv("../datas/revolutionary_war.csv",
                  parse_dates = ["Start Date"],
                  index_col = "Start Date",
                  usecols = ["Start Date","State"]).squeeze(True)
war

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 232, dtype: object

In [135]:
a = war.isnull().sum()
print(a)
print(len(war) - a)
print(war.nunique())

70
162
17

In [137]:
war.sort_values(na_position='last') # na_position으로 nan값을 위에둘지 밑에둘지 정렬하는것에대한 기준을 정해줄 수 있음

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
1777-09-03       Delaware
1777-05-17        Florida
                 ...
1782-08-08            NaN
1782-08-25            NaN
1782-09-13            NaN
1782-10-18            NaN
1782-12-06            NaN
Name: State, Length: 232, dtype: object

In [138]:
war.dropna() #dropna()메소드를 사용하면 nan값을 배제시킬 수 있음.

Start Date
1774-09-01     Massachusetts
1774-12-14     New Hampshire
1775-04-19     Massachusetts
1775-04-19     Massachusetts
1775-04-20          Virginia
                   ...
1782-08-15          Virginia
1782-08-19          Virginia
1782-08-26    South Carolina
1782-09-11          Virginia
1783-01-22          Virginia
Name: State, Length: 162, dtype: object

In [151]:
#위에서 sort_values를 사용하여 값에대한 오름차순을 진행하였다면 sort_index는 인덱스에대한 오름차순으로 정렬을 가능하게 해줌
pokemons.sort_index(ascending=True)

Pokemon
Abomasnow        Grass / Ice
Abra                 Psychic
Absol                   Dark
Accelgor                 Bug
Aegislash      Steel / Ghost
                  ...
Zoroark                 Dark
Zorua                   Dark
Zubat        Poison / Flying
Zweilous       Dark / Dragon
Zygarde      Dragon / Ground
Name: Type, Length: 809, dtype: object

In [152]:
war.sort_index()

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1783-01-22         Virginia
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
Name: State, Length: 232, dtype: object

In [154]:
war.sort_index(na_position="first") #sort_index메소드에서도 na_position을 사용할 수 있다.

Start Date
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
1774-09-01    Massachusetts
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 232, dtype: object

In [188]:
war.loc[war.index.dropna()]

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-19    Massachusetts
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 250, dtype: object

In [190]:
war.loc[war.index.notnull()] #위의 방법 보단 notnull이 더 정확한 방법.

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 228, dtype: object

In [201]:
war.index.value_counts()[:11]

1781-04-25    2
1781-05-22    2
1780-08-18    2
1781-09-13    2
1782-03-16    2
1780-05-25    2
1778-09-07    2
1782-01-11    2
1777-08-22    2
1775-04-19    2
1781-04-15    2
Name: Start Date, dtype: int64

In [184]:
google = google.sort_values(ascending = False)
print(google.head(10))
google = google.sort_values(ascending = True)
print(google.head(10))

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
2018-07-25    1263.70
2019-04-25    1263.45
2019-10-24    1260.99
2019-10-23    1259.13
2019-04-24    1256.00
Name: Close, dtype: float64
Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
2004-08-30    50.81
2004-09-08    50.96
2004-09-09    50.96
2004-08-31    50.99
2004-08-24    52.24
Name: Close, dtype: float64

In [185]:
google.nlargest(10)

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
2018-07-25    1263.70
2019-04-25    1263.45
2019-10-24    1260.99
2019-10-23    1259.13
2019-04-24    1256.00
Name: Close, dtype: float64

In [187]:
google.nsmallest(10)

Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
2004-08-30    50.81
2004-09-08    50.96
2004-09-09    50.96
2004-08-31    50.99
2004-08-24    52.24
Name: Close, dtype: float64

In [202]:
pokemons.value_counts()

Normal                65
Water                 61
Grass                 38
Psychic               35
Fire                  30
                      ..
Fire / Psychic         1
Normal / Ground        1
Psychic / Fighting     1
Dark / Ghost           1
Fire / Ghost           1
Name: Type, Length: 159, dtype: int64

In [203]:
bins = np.linspace(0,1400,8)
bins

array([   0.,  200.,  400.,  600.,  800., 1000., 1200., 1400.])

In [229]:
google.value_counts(bins=bins)

(200.0, 400.0]      1568
(-0.001, 200.0]      595
(400.0, 600.0]       575
(1000.0, 1200.0]     406
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1200.0, 1400.0]      93
Name: Close, dtype: int64

In [236]:
google.value_counts(bins=bins).sort_index()

(-0.001, 200.0]      595
(200.0, 400.0]      1568
(400.0, 600.0]       575
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1000.0, 1200.0]     406
(1200.0, 1400.0]      93
Name: Close, dtype: int64

In [237]:
google.value_counts(bins=8,sort=False)

(48.581, 204.54]       651
(204.54, 359.26]      1435
(359.26, 513.98]       263
(513.98, 668.7]        466
(668.7, 823.42]        334
(823.42, 978.14]       161
(978.14, 1132.86]      283
(1132.86, 1287.58]     231
Name: Close, dtype: int64

In [240]:
data = {"c1":[1,2,'누락'],
        "c2":[1.11,'',3.33],
        "c3":['one','two','three']}
a = pd.DataFrame(data)
a

   c1    c2     c3
0   1  1.11    one
1   2          two
2  누락  3.33  three

In [268]:
a.to_csv("sample.csv",index = False)

In [281]:
a_read = pd.read_csv("sample.csv")
a_read

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [292]:
a.to_csv("sample2.csv",index = False, header = False)
a

   c1    c2     c3
0   1  1.11    one
1   2          two
2  누락  3.33  three

In [287]:
pd.read_csv('sample2.csv',names=['c1','c2','c3'])

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [290]:
%%writefile sample3.txt
c1 c2 c3 c4
0.179181 -1.538472 1.347553 0.43381
1.024209 0.087307 -1.281997 0.49265
0.417899 -2.002308 0.255245 -1.10515

Writing sample3.txt

In [306]:
pd.read_table('sample3.txt',sep='\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [299]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting sample4.txt

In [311]:
pd.read_csv('sample4.txt',skiprows=range(2))

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [312]:
df_na_val = pd.read_csv('sample.csv',na_values=['누락'])
df_na_val

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

In [314]:
df_na_val.to_csv('sample5.txt',sep='|')
df_na_val

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

In [318]:
pd.read_csv('sample5.txt')

        |c1|c2|c3
0  0|1.0|1.11|one
1      1|2.0||two
2   2||3.33|three

In [319]:
df_na_val

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

In [322]:
df_na_val.to_csv('sample6.csv',na_rep = '누락')

In [324]:
pd.read_csv('sample6.csv')

   Unnamed: 0   c1    c2     c3
0           0  1.0  1.11    one
1           1  2.0    누락    two
2           2   누락  3.33  three

In [325]:
titanic = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv")

In [326]:
titanic

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
...,...,...,...,...,...,...,...,...,...,...
622,0,male,28.0,0,0,10.5000,Second,unknown,Southampton,y
623,0,male,25.0,0,0,7.0500,Third,unknown,Southampton,y
624,1,female,19.0,0,0,30.0000,First,B,Southampton,y
625,0,female,28.0,1,2,23.4500,Third,unknown,Southampton,n
626,0,male,32.0,0,0,7.7500,Third,unknown,Queenstown,y

In [329]:
titanic.describe().round(2).T

                    count   mean    std   min   25%    50%    75%     max
survived            627.0   0.39   0.49  0.00   0.0   0.00   1.00    1.00
age                 627.0  29.63  12.51  0.75  23.0  28.00  35.00   80.00
n_siblings_spouses  627.0   0.55   1.15  0.00   0.0   0.00   1.00    8.00
parch               627.0   0.38   0.79  0.00   0.0   0.00   0.00    5.00
fare                627.0  34.39  54.60  0.00   7.9  15.05  31.39  512.33

In [330]:
titanic.head(10)

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
5,0,male,2.0,3,1,21.0750,Third,unknown,Southampton,n
6,1,female,27.0,0,2,11.1333,Third,unknown,Southampton,n
7,1,female,14.0,1,0,30.0708,Second,unknown,Cherbourg,n
8,1,female,4.0,1,1,16.7000,Third,G,Southampton,n
9,0,male,20.0,0,0,8.0500,Third,unknown,Southampton,y

In [354]:
titanic.to_csv("titanic1.csv",na_rep="0")

In [352]:
b = pd.read_csv("titanic1.csv",na_values=['unknown'])

In [356]:
b.head(10)

,Unnamed: 0.4,Unnamed: 0.3,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,0,0,0,0,0,male,22.0,1,0,7.2500,Third,0,Southampton,n
1,1,1,1,1,1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,2,2,2,2,2,1,female,26.0,0,0,7.9250,Third,0,Southampton,y
3,3,3,3,3,3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,4,4,4,4,4,0,male,28.0,0,0,8.4583,Third,0,Queenstown,y
5,5,5,5,5,5,0,male,2.0,3,1,21.0750,Third,0,Southampton,n
6,6,6,6,6,6,1,female,27.0,0,2,11.1333,Third,0,Southampton,n
7,7,7,7,7,7,1,female,14.0,1,0,30.0708,Second,0,Cherbourg,n
8,8,8,8,8,8,1,female,4.0,1,1,16.7000,Third,G,Southampton,n
9,9,9,9,9,9,0,male,20.0,0,0,8.0500,Third,0,Southampton,y

In [383]:
import requests as rq
response = rq.get('http://apis.data.go.kr/B553077/api/open/sdsc2/storeZoneOne', 
                  params ={'key':'9174',
                           'servicekey':'H55ytCNTC99pCeHIKNmCD7DRnTOTGlYMpRithtSSMo+gUWCPFgT1s35IiZ0FAXnEFkakqocycpLNloJOtKddyA==',
                           'type':'json'})
response.status_code
#a = response.json()
b = a['body']['items']
c = pd.DataFrame(b)
c.to_csv("testdata.csv")

In [384]:
%pwd

'C:\\python\\datas'